Revit 2027 API
FabricationPart.DoubleWallMaterialArea Property
 The double wall material area of the fabrication part. If the fabrication part is not double walled, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DoubleWallMaterialArea { get; }
Public ReadOnly Property DoubleWallMaterialArea As Double
	Get
public:
property double DoubleWallMaterialArea {
	double get ();
}
member DoubleWallMaterialArea : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace